# daskのquery関数わかりにくすぎワロタ

* 数字の場合
* 文字列("ABC")の場合
* 数字だけど文字列型の場合、多分"123"と"012"で違ってくる

In [10]:
import pandas as pd
import dask.dataframe as dd

In [11]:
# https://linus-mk.hatenablog.com/entry/pandas-unique-integer-id

In [12]:
df = pd.DataFrame({
    'name'    : ['Alice', 'Bob', 'Charlie', 'Charlie', 'Alice', 'Bob'],
    'item' : ['aaa', 'bbb', 'ccc', 'ddd', 'eee', 'fff'],
    'number'    : [3, 2, 4, 3, 2, 1],
})

In [13]:
df

      name item  number
0    Alice  aaa       3
1      Bob  bbb       2
2  Charlie  ccc       4
3  Charlie  ddd       3
4    Alice  eee       2
5      Bob  fff       1

In [14]:
df.query("name=='Bob'")

  name item  number
1  Bob  bbb       2
5  Bob  fff       1

In [15]:
ddf = dd.from_pandas(df)

ValueError: Exactly one of npartitions and chunksize must be specified.

In [16]:
ddf = dd.from_pandas(df, npartitions=1)

In [18]:
ddf.compute()

      name item  number
0    Alice  aaa       3
1      Bob  bbb       2
2  Charlie  ccc       4
3  Charlie  ddd       3
4    Alice  eee       2
5      Bob  fff       1

In [21]:
ddf.query("name=='Bob'").compute()

  name item  number
1  Bob  bbb       2
5  Bob  fff       1

In [26]:
target = 'Bob'
ddf.query(f"name=='{target}'").compute()

  name item  number
1  Bob  bbb       2
5  Bob  fff       1

In [23]:
num = 2
ddf.query(f"number=={num}").compute()

    name item  number
1    Bob  bbb       2
4  Alice  eee       2

In [24]:
f"name=={target}"

'name==Bob'